tap "d12frosted/emacs-plus"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "norwoodj/tap"
tap "peak/tap"
tap "pulumi/tap"
tap "wez/wezterm"
# CLI tool for working with Architecture Decision Records
brew "adr-tools"
# Simple, modern, secure file encryption
brew "age"
# General-purpose data compression with high compression ratio
brew "xz"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Download with resuming and segmented downloading
brew "aria2"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Command-line tool to manipulate Android App Bundles
brew "bundletool"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Tool for exploring each layer in a docker image
brew "dive"
# Modern, maintained replacement for ls
brew "eza"
# Easiest way to build and release mobile apps
brew "fastlane"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GNU awk utility
brew "gawk"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU unit conversion tool
brew "gnu-units"
# Language server for the Go language
brew "gopls"
# Kubernetes package manager
brew "helm"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Run local Kubernetes cluster in Docker
brew "kind"
# Kubernetes command-line interface
brew "kubernetes-cli"
# JIT library for the GNU compiler collection
brew "libgccjit"
# C99 library which implements a VT220 or xterm terminal emulator
brew "libvterm"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Python package management tool
brew "poetry"
# Password generator
brew "pwgen"
# QR Code generation
brew "qrencode"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Editor of encrypted files
brew "sops"
# Cross-shell prompt for astronauts
brew "starship"
# SMTP command-line test tool
brew "swaks"
# Tool to generate documentation from Terraform modules
brew "terraform-docs"
# Terminal multiplexer
brew "tmux"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Execute commands when watched files change
brew "watchexec"
# Friendly and fast tool for sending HTTP requests
brew "xh"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# GNU Emacs text editor
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-native-comp", "with-nobu417-big-sur-icon"]
# Terraform
brew "hashicorp/tap/terraform"
# Terraform Language Server
brew "hashicorp/tap/terraform-ls"
# Automatically generate markdown documentation for helm charts
brew "norwoodj/tap/helm-docs"
# Parallel S3 and local filesystem execution tool
brew "peak/tap/s5cmd"
# Pulumi - Modern Infrastructure as Code. Any cloud, any language 
brew "pulumi/tap/pulumi"
# Tools for building Android applications
cask "android-studio"
# App to build and share containerised applications and microservices
cask "docker"
cask "font-asap"
# Monospaced typeface designed for programming in Julia
cask "font-juliamono"
cask "font-petrona"
# Web browser
cask "google-chrome"
# Tools to protect your files
cask "gpg-suite-no-mail"
# Open-source video transcoder
cask "handbrake"
# Open-source screen recorder built with web technology
cask "kap"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Quick Look plugin for mobile apps and provisioning profiles
cask "provisionql"
# Multimedia player
cask "vlc"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
